# 前端技术风云录
# HTML
# HTML 超文本标记语言，它不同于编程语言
# 超文本就是超出纯文本范畴，例如打桩文件的颜色，大小，字体等信息，
# 超文本需要显示 ，就得有软件能够呈现超文本定义的排版格式，例如显示图片，表格，显示字体，
# 1980年代，TIM Berners-Lee为CERN欧洲核子研究中心，当时欧洲最大的互联网节点，设计基于超文本思想的ENQUIRE项目
# ，以促进科研人员之间的信息共享和更新，1989年编写的信息化管理建义，一文，并构建基于Internet的Hypertext系统，并在CERN
# 开发了World Wide WEb 项目，打造了世界上的第一个网站，于1991年8月6号正式上线
# Tim Berners-Lee 于1990 年发明了每一个浏览器，还发明了HTTP 协义
# 1994 年MIT 他创建了W3C ，W3C 万维网联盟，负责万维网持续发展，他提出了W3C 的标准应该基于无专利权，无版本税
# Marc Andreessen 于1993年发明了Mosaic浏览器，看到了这个技术前景，不久后他成立自己的公司-网景Netscape ，1994 发布了Netscape Navigotor浏览器
# 最终后来居上
# 由于IE 的捆绑销售行为，网景的单一的浏览器市场萎缩，从1990年的90% 下降到2006年的1%
# 1999年网景被AOL收购，收购后不久，Netscape公开了浏览器代码，并创建了MOzilla组织，Mozilla组织使用Gecko引擎重写了浏览器
# Mozilla组织使用GEcko 引擎发布了几款浏览器，最终2004年更名为Firefox浏览器
# 2003年5月，网景被解散
# AOL 于2007年12月宣布停止支持Netscape浏览器
# Apple的Safari于2003发布了第一个测试版本
# 2008年Google的Chrome浏览器带来V8引擎横空出世
# 网景公司的技术
# HTTP Cookie ，解决HTTP无状态
# JavaScript
# SSL协义
# JAR格式文件，将Java的class文件打包压缩，并加上签名
# 2012年4月9日，微软以10亿5千购买800项美国在线的专利或专利授权，专家认为网景的SSL,Cookie等专利可能是微软愿意出高价的理由之一
# 摘自wiki百科
# 浏览器技术
# 浏览器是一种客户端，能基于HTTPS,FTP等协义和服务器进行交互，呈现给网页内容软件
# 可以简单的认为浏览器软件分为2个部分
# 外壳
#   外壳提供用户交互的界面
# 内核引擎Engine
# 提供HTML,CSS，图像的渲染引擎，提供DOM 编程接口
# 提供javaScript引擎
# Firefox       C++开发并最早开源，可以支持复杂的网页效果，提供了强大的浏览器扩展接口
# IE,AOL        早期未按照W3C标准实现，兼容性很差，IE9之后内核升级以符合标准
#               KDE 与1998年开发
# Presto    Opera   目前公认网页浏览速度最快的内核，但是牺牲了一部分兼容性
# WEbKit    Safari Chrome       WebKit 基于KHtml开发 ，网页浏览速度较快，但是网页容错性能不高
# Blink     基于WebKit WebCore
# 其他的国家的浏览器，一般都是采用了以上的实现了一个或者两个内核加上外壳实现
#